Repository: huwung/ProjektOmegaT
Catalog: training/materials/legacy/english_to_italian.tmx
Source language: en
Languages: it

source: From Wikipedia, the free encyclopedia
it: Da Wikipedia, l'enciclopedia libera.

source: Citizen
it: CittadinoCitizen

source: United States
it: Stati Uniti

source: Main page
it: Pagina principale

source: Random article
it: Un voce a caso

source: Recent changes
it: Ultime modifiche

source: Make a donation
it: Donazioni

source: Help
it: Aiuto

source: Search
it: Ricerca

source: Printable version
it: Versione stampabile

source: Permanent link
it: Link permanente

source: Cite this article
it: Cita questa voce

source: Certain essential elements of Yoga are very important both for Buddhism in general, and for Zen in particular.
it: Certi elementi essenziali del Yoga sono molto importanti sia per il buddhismo in generale, sia per lo zen nel particolare.

source: For the definition of jnana as "knowledge" see: Apte, p. 457.
it: Per la definizione di jana come "sapienza", vedi: Apte, p. 457.

source: The word Jnana in Sanskrit means "knowledge".
it: La parola Jnana nella lingua Sanskrit significa "sapienza".

source: The Bhagavad Gita gives a summary of this process.
it: Il Bhagavad Gita fa un riassunto di questo processo.

source: This action is not just work; it is karma yoga.
it: Questa azione non è semplicemente lavoro; è karma yoga.

source: Shankaracharya says by practicing Karma, the mind gets purified.
it: Shankaracharya dice che chi si esercita a Karma si purifica la mente.

source: A Slavic ethnic group
it: Un gruppo etnico slavo

source: Many Russian-Americans do not speak Russian, having immigrated to the United States more than forty years ago.
it: Molti americani russi non parlano russo, perché sono immigrati negli stati uniti più di 40 anni fa.

source: Many Russian Americans are Jews.
it: Molti americani russi sono ebrei.

source: Russian Empire, a European state that existed from 1721 until 1917
it: L'Impero Russo, uno stato europeo che esistava dal 1721 fino al 1917

source: Russky Island, an island
it: L'isola Russky, un'isola

source: Action without attachment to the fruits of one's deeds.
it: Azione senza collegamento ai frutti dei propri fatti.

source: Karma Yoga is an important part of many types of yoga, such as Natya Yoga.
it: Karma yoga fa parte importante di molti tipi di yoga, per esempio natya yoga.
